Repository: Vijayapardhu/Prayanam
Catalog: locale/*/LC_MESSAGES/django.po
Languages: te

source: Home
te: హోమ్

source: Places
te: ప్రదేశాలు

source: Packages
te: ప్యాకేజీలు

source: Events
te: కార్యక్రమాలు

source: My Itineraries
te: నా ప్రయాణ ప్రణాళికలు

source: Payments
te: చెల్లింపులు

source: My Account
te: నా ఖాతా

source: Admin Panel
te: అడ్మిన్ ప్యానెల్

source: Logout
te: లాగ్అవుట్

source: Login
te: లాగిన్

source: Register
te: నమోదు

source: Smart Travel & Booking Platform
te: స్మార్ట్ ట్రావెల్ & బుకింగ్ ప్లాట్‌ఫార్మ్

source: Discover amazing destinations and book your perfect trip
te: అద్భుతమైన గమ్యస్థానాలను కనుగొని మీ ఖచ్చితమైన ప్రయాణాన్ని బుక్ చేసుకోండి

source: Explore Destinations
te: గమ్యస్థానాలను అన్వేషించండి

source: Book Packages
te: ప్యాకేజీలను బుక్ చేయండి

source: Plan Events
te: కార్యక్రమాలను ప్లాన్ చేయండి

source: Get Support
te: సహాయం పొందండి

source: Welcome Back
te: మళ్ళీ స్వాగతం

source: Sign in to your account
te: మీ ఖాతాలోకి సైన్ ఇన్ చేయండి

source: Create Account
te: ఖాతా సృష్టించండి

source: Join us for amazing travel experiences
te: అద్భుతమైన ప్రయాణ అనుభవాల కోసం మాతో చేరండి

source: Dashboard
te: డాష్‌బోర్డ్

source: Manage your travel bookings and preferences
te: మీ ప్రయాణ బుకింగ్‌లు మరియు ప్రాధాన్యతలను నిర్వహించండి

source: Explore Places
te: ప్రదేశాలను అన్వేషించండి

source: Discover amazing destinations across Telugu states
te: తెలుగు రాష్ట్రాలలో అద్భుతమైన గమ్యస్థానాలను కనుగొనండి

source: Travel Packages
te: ప్రయాణ ప్యాకేజీలు

source: Find the perfect travel package for your adventure
te: మీ సాహసానికి ఖచ్చితమైన ప్రయాణ ప్యాకేజీని కనుగొనండి

source: Events & Activities
te: కార్యక్రమాలు & కార్యక్రమాలు

source: Discover exciting events and activities
te: ఉత్తేజకరమైన కార్యక్రమాలు మరియు కార్యక్రమాలను కనుగొనండి

source: Book Your Trip
te: మీ ప్రయాణాన్ని బుక్ చేయండి

source: Complete your booking details
te: మీ బుకింగ్ వివరాలను పూర్తి చేయండి

source: Payment
te: చెల్లింపు

source: Complete your payment securely
te: మీ చెల్లింపును సురక్షితంగా పూర్తి చేయండి

source: Payment Successful
te: చెల్లింపు విజయవంతం

source: Your payment has been processed successfully
te: మీ చెల్లింపు విజయవంతంగా ప్రాసెస్ చేయబడింది

source: Admin Dashboard
te: అడ్మిన్ డాష్‌బోర్డ్

source: Manage your travel platform
te: మీ ప్రయాణ ప్లాట్‌ఫార్మ్‌ని నిర్వహించండి

source: Contact Us
te: మమ్మల్ని సంప్రదించండి

source: Get in touch with our support team
te: మా సహాయ బృందంతో సంప్రదించండి

source: Frequently Asked Questions
te: తరచుగా అడిగే ప్రశ్నలు

source: Find answers to common questions
te: సాధారణ ప్రశ్నలకు సమాధానాలను కనుగొనండి

source: Help Center
te: సహాయ కేంద్రం

source: Get help and support for your travel needs
te: మీ ప్రయాణ అవసరాల కోసం సహాయం మరియు మద్దతు పొందండి

source: Quick Links
te: త్వరిత లింక్‌లు

source: Reviews
te: సమీక్షలు

source: Support
te: మద్దతు

source: Connect
te: కనెక్ట్

source: Follow us for travel inspiration and updates!
te: ప్రయాణ ప్రేరణ మరియు నవీకరణల కోసం మమ్మల్ని అనుసరించండి!

source: All rights reserved.
te: అన్ని హక్కులు రిజర్వ్ చేయబడ్డాయి.

source: Language
te: భాష

source: English
te: ఆంగ్లం

source: हिन्दी
te: హిందీ
